<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [1]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [2]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  1.180271 -0.602856 -0.317214  0.362123
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-03  1.424727  0.445893  0.085154 -0.301223
2013-01-04  0.241239  0.314981 -0.488092 -0.774441
2013-01-05 -0.075114 -0.890753  0.103083  0.940285
2013-01-06 -1.018115 -0.366363 -0.468451 -1.512358

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [5]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [7]:
df.head()

                   A         B         C         D
2013-01-01  1.180271 -0.602856 -0.317214  0.362123
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-03  1.424727  0.445893  0.085154 -0.301223
2013-01-04  0.241239  0.314981 -0.488092 -0.774441
2013-01-05 -0.075114 -0.890753  0.103083  0.940285

In [8]:
df.tail()

                   A         B         C         D
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-03  1.424727  0.445893  0.085154 -0.301223
2013-01-04  0.241239  0.314981 -0.488092 -0.774441
2013-01-05 -0.075114 -0.890753  0.103083  0.940285
2013-01-06 -1.018115 -0.366363 -0.468451 -1.512358

index, columns를 표현합니다.

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [11]:
df

                   A         B         C         D
2013-01-01  1.180271 -0.602856 -0.317214  0.362123
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-03  1.424727  0.445893  0.085154 -0.301223
2013-01-04  0.241239  0.314981 -0.488092 -0.774441
2013-01-05 -0.075114 -0.890753  0.103083  0.940285
2013-01-06 -1.018115 -0.366363 -0.468451 -1.512358

In [12]:
df.to_numpy()

array([[ 1.18027097, -0.60285609, -0.31721353,  0.36212257],
       [ 0.30003056, -0.03735183, -1.03326396, -2.35674533],
       [ 1.42472688,  0.44589319,  0.0851544 , -0.30122281],
       [ 0.24123943,  0.31498079, -0.48809236, -0.77444148],
       [-0.07511409, -0.89075318,  0.10308321,  0.9402846 ],
       [-1.0181149 , -0.3663625 , -0.46845057, -1.51235755]])

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [15]:
df

                   A         B         C         D
2013-01-01  1.180271 -0.602856 -0.317214  0.362123
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-03  1.424727  0.445893  0.085154 -0.301223
2013-01-04  0.241239  0.314981 -0.488092 -0.774441
2013-01-05 -0.075114 -0.890753  0.103083  0.940285
2013-01-06 -1.018115 -0.366363 -0.468451 -1.512358

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.180271    0.300031    1.424727    0.241239   -0.075114   -1.018115
B   -0.602856   -0.037352    0.445893    0.314981   -0.890753   -0.366363
C   -0.317214   -1.033264    0.085154   -0.488092    0.103083   -0.468451
D    0.362123   -2.356745   -0.301223   -0.774441    0.940285   -1.512358

axis=1(열)을 기준으로 정렬합니다.

In [17]:
df

                   A         B         C         D
2013-01-01  1.180271 -0.602856 -0.317214  0.362123
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-03  1.424727  0.445893  0.085154 -0.301223
2013-01-04  0.241239  0.314981 -0.488092 -0.774441
2013-01-05 -0.075114 -0.890753  0.103083  0.940285
2013-01-06 -1.018115 -0.366363 -0.468451 -1.512358

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.362123 -0.317214 -0.602856  1.180271
2013-01-02 -2.356745 -1.033264 -0.037352  0.300031
2013-01-03 -0.301223  0.085154  0.445893  1.424727
2013-01-04 -0.774441 -0.488092  0.314981  0.241239
2013-01-05  0.940285  0.103083 -0.890753 -0.075114
2013-01-06 -1.512358 -0.468451 -0.366363 -1.018115

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-05 -0.075114 -0.890753  0.103083  0.940285
2013-01-01  1.180271 -0.602856 -0.317214  0.362123
2013-01-06 -1.018115 -0.366363 -0.468451 -1.512358
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-04  0.241239  0.314981 -0.488092 -0.774441
2013-01-03  1.424727  0.445893  0.085154 -0.301223

# 가져오기

single column을 선택하면 Series 가 생성이 됩니다.

df.A와 기능이 동등합니다.

In [20]:
df["A"]

2013-01-01    1.180271
2013-01-02    0.300031
2013-01-03    1.424727
2013-01-04    0.241239
2013-01-05   -0.075114
2013-01-06   -1.018115
Freq: D, Name: A, dtype: float64

[]을 사용하면 행을 분할(슬라이싱) 합니다.

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01  1.180271 -0.602856 -0.317214  0.362123
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-03  1.424727  0.445893  0.085154 -0.301223

In [22]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-03  1.424727  0.445893  0.085154 -0.301223
2013-01-04  0.241239  0.314981 -0.488092 -0.774441

# 레이블별 선택

레이블을 사용하여 가져오기

In [23]:
df.loc[dates[0]]

A    1.180271
B   -0.602856
C   -0.317214
D    0.362123
Name: 2013-01-01 00:00:00, dtype: float64

컬럼을 다중으로 선택하여 가져오기

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.180271 -0.602856
2013-01-02  0.300031 -0.037352
2013-01-03  1.424727  0.445893
2013-01-04  0.241239  0.314981
2013-01-05 -0.075114 -0.890753
2013-01-06 -1.018115 -0.366363

종료지점을 포함한 슬라이싱

In [25]:
df.loc["20130102" : "20130104", ["A","B"]]

                   A         B
2013-01-02  0.300031 -0.037352
2013-01-03  1.424727  0.445893
2013-01-04  0.241239  0.314981

객체가 반환하는 차원이 감소합니다.

In [26]:
df.loc["20130102", ["A","B"]]

A    0.300031
B   -0.037352
Name: 2013-01-02 00:00:00, dtype: float64

scalar 값을 가져옵니다

In [27]:
df.loc[dates[0], "A"]

1.1802709698404061

scalar에 빠르게 엑세스하여 가져오는 방법입니다.

In [28]:
# df.at["20130101","A"]
df.at[dates[0],"A"]

1.1802709698404061

# 위치(position)별로 선택

전달된 정수(integers)의 위치를 통해 다음을 선택

In [29]:
df.iloc[3]

A    0.241239
B    0.314981
C   -0.488092
D   -0.774441
Name: 2013-01-04 00:00:00, dtype: float64

슬라이싱을 통해 Numpy/Python과 유사하게 작동합니다.

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.241239  0.314981
2013-01-05 -0.075114 -0.890753

정수 리스트를 통해 표현

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.300031 -1.033264
2013-01-03  1.424727  0.085154
2013-01-05 -0.075114  0.103083

row(행)만 슬라이싱을 합니다.

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-03  1.424727  0.445893  0.085154 -0.301223

columns(열)만 슬라이싱 합니다.

In [33]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.602856 -0.317214
2013-01-02 -0.037352 -1.033264
2013-01-03  0.445893  0.085154
2013-01-04  0.314981 -0.488092
2013-01-05 -0.890753  0.103083
2013-01-06 -0.366363 -0.468451

value(값)로 가져옵니다.

In [34]:
df.iloc[1,1]

-0.037351828443568554

scalar를 빠르게 엑세스하여 가져옵니다.

In [35]:
df.iat[1,1]

-0.037351828443568554

#Boolean indexing

single column의 value를 통해 선택합니다.

In [36]:
df[df["A"]>0]

                   A         B         C         D
2013-01-01  1.180271 -0.602856 -0.317214  0.362123
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-03  1.424727  0.445893  0.085154 -0.301223
2013-01-04  0.241239  0.314981 -0.488092 -0.774441

In [37]:
df

                   A         B         C         D
2013-01-01  1.180271 -0.602856 -0.317214  0.362123
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745
2013-01-03  1.424727  0.445893  0.085154 -0.301223
2013-01-04  0.241239  0.314981 -0.488092 -0.774441
2013-01-05 -0.075114 -0.890753  0.103083  0.940285
2013-01-06 -1.018115 -0.366363 -0.468451 -1.512358

In [38]:
df[df>0]

                   A         B         C         D
2013-01-01  1.180271       NaN       NaN  0.362123
2013-01-02  0.300031       NaN       NaN       NaN
2013-01-03  1.424727  0.445893  0.085154       NaN
2013-01-04  0.241239  0.314981       NaN       NaN
2013-01-05       NaN       NaN  0.103083  0.940285
2013-01-06       NaN       NaN       NaN       NaN

isin() method를 통해 필터링

In [39]:
df2 = df.copy()
df2['E'] = ["one","one","two","three","four","three"]
df2

                   A         B         C         D      E
2013-01-01  1.180271 -0.602856 -0.317214  0.362123    one
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745    one
2013-01-03  1.424727  0.445893  0.085154 -0.301223    two
2013-01-04  0.241239  0.314981 -0.488092 -0.774441  three
2013-01-05 -0.075114 -0.890753  0.103083  0.940285   four
2013-01-06 -1.018115 -0.366363 -0.468451 -1.512358  three

In [40]:
df2[df2['E'].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03  1.424727  0.445893  0.085154 -0.301223   two
2013-01-05 -0.075114 -0.890753  0.103083  0.940285  four

# Setting

새로운 column을 설정하면 index별로 데이터가 자동으로 정렬됩니다.

In [41]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df['F'] = s1

In [43]:
df

                   A         B         C         D    F
2013-01-01  1.180271 -0.602856 -0.317214  0.362123  NaN
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745  1.0
2013-01-03  1.424727  0.445893  0.085154 -0.301223  2.0
2013-01-04  0.241239  0.314981 -0.488092 -0.774441  3.0
2013-01-05 -0.075114 -0.890753  0.103083  0.940285  4.0
2013-01-06 -1.018115 -0.366363 -0.468451 -1.512358  5.0

label 별로 value를 설정합니다.

In [44]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.602856 -0.317214  0.362123  NaN
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745  1.0
2013-01-03  1.424727  0.445893  0.085154 -0.301223  2.0
2013-01-04  0.241239  0.314981 -0.488092 -0.774441  3.0
2013-01-05 -0.075114 -0.890753  0.103083  0.940285  4.0
2013-01-06 -1.018115 -0.366363 -0.468451 -1.512358  5.0

position 별로 value를 설정합니다.

In [45]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.317214  0.362123  NaN
2013-01-02  0.300031 -0.037352 -1.033264 -2.356745  1.0
2013-01-03  1.424727  0.445893  0.085154 -0.301223  2.0
2013-01-04  0.241239  0.314981 -0.488092 -0.774441  3.0
2013-01-05 -0.075114 -0.890753  0.103083  0.940285  4.0
2013-01-06 -1.018115 -0.366363 -0.468451 -1.512358  5.0

NumPy array를 할당하여 설정합니다.

In [46]:
df.loc[:,"D"] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.317214  5  NaN
2013-01-02  0.300031 -0.037352 -1.033264  5  1.0
2013-01-03  1.424727  0.445893  0.085154  5  2.0
2013-01-04  0.241239  0.314981 -0.488092  5  3.0
2013-01-05 -0.075114 -0.890753  0.103083  5  4.0
2013-01-06 -1.018115 -0.366363 -0.468451  5  5.0

In [47]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.317214 -5  NaN
2013-01-02 -0.300031 -0.037352 -1.033264 -5 -1.0
2013-01-03 -1.424727 -0.445893 -0.085154 -5 -2.0
2013-01-04 -0.241239 -0.314981 -0.488092 -5 -3.0
2013-01-05 -0.075114 -0.890753 -0.103083 -5 -4.0
2013-01-06 -1.018115 -0.366363 -0.468451 -5 -5.0

# 결측치

pandas는 주로  np.nan값을 누락 데이터를 나타내기 위하여 사용합니다.

In [48]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.317214  5  NaN  1.0
2013-01-02  0.300031 -0.037352 -1.033264  5  1.0  1.0
2013-01-03  1.424727  0.445893  0.085154  5  2.0  NaN
2013-01-04  0.241239  0.314981 -0.488092  5  3.0  NaN

how = 'any' 옵션을 사용하여 결측치를 가지고 있지 않는 데이터를 보여줍니다.

In [49]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.300031 -0.037352 -1.033264  5  1.0  1.0

결측치를 채우기

In [50]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.317214  5  5.0  1.0
2013-01-02  0.300031 -0.037352 -1.033264  5  1.0  1.0
2013-01-03  1.424727  0.445893  0.085154  5  2.0  5.0
2013-01-04  0.241239  0.314981 -0.488092  5  3.0  5.0

nan값을 가진 value를 boolean mask로 가져옵니다.

In [51]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.317214  5  NaN  1.0
2013-01-02  0.300031 -0.037352 -1.033264  5  1.0  1.0
2013-01-03  1.424727  0.445893  0.085154  5  2.0  NaN
2013-01-04  0.241239  0.314981 -0.488092  5  3.0  NaN

In [52]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Stats

In [53]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.317214  5  NaN
2013-01-02  0.300031 -0.037352 -1.033264  5  1.0
2013-01-03  1.424727  0.445893  0.085154  5  2.0
2013-01-04  0.241239  0.314981 -0.488092  5  3.0
2013-01-05 -0.075114 -0.890753  0.103083  5  4.0
2013-01-06 -1.018115 -0.366363 -0.468451  5  5.0

In [54]:
df.mean()

A    0.145461
B   -0.088932
C   -0.353130
D    5.000000
F    3.000000
dtype: float64

In [55]:
df.mean(1)

2013-01-01    1.170697
2013-01-02    1.045883
2013-01-03    1.791155
2013-01-04    1.613626
2013-01-05    1.627443
2013-01-06    1.629414
Freq: D, dtype: float64

In [56]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

크기가 다르고 정렬이 필요한 객체로 작업합니다.

pandas는 지정된 차원을 따라 자동으로 broadcast합니다.

In [58]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.424727 -0.554107 -0.914846  4.0  1.0
2013-01-04 -2.758761 -2.685019 -3.488092  2.0  0.0
2013-01-05 -5.075114 -5.890753 -4.896917  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# Apply

In [60]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.317214  5  NaN
2013-01-02  0.300031 -0.037352 -1.033264  5  1.0
2013-01-03  1.424727  0.445893  0.085154  5  2.0
2013-01-04  0.241239  0.314981 -0.488092  5  3.0
2013-01-05 -0.075114 -0.890753  0.103083  5  4.0
2013-01-06 -1.018115 -0.366363 -0.468451  5  5.0

In [59]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.317214   5   NaN
2013-01-02  0.300031 -0.037352 -1.350477  10   1.0
2013-01-03  1.724757  0.408541 -1.265323  15   3.0
2013-01-04  1.965997  0.723522 -1.753415  20   6.0
2013-01-05  1.890883 -0.167231 -1.650332  25  10.0
2013-01-06  0.872768 -0.533594 -2.118783  30  15.0

In [65]:
df.apply(lambda x : x.max() - x.min())

A    2.442842
B    1.336646
C    1.136347
D    0.000000
F    4.000000
dtype: float64